<?php if ( ! defined('BASEPATH')) exit('No direct script access allowed');

/*
|--------------------------------------------------------------------------
| 장비 카테고리
|--------------------------------------------------------------------------
| 관리성 때문에 
| DB 를 이용하기로 함
|
| 자주 참조되므로 배열로 캐싱 해 놓으면 좋겠다
*/
$config['gs2']['category'] = array();

// 업무 형태 (대분류)
$config['gs2']['op_type'] = array(
	'100'	=> '입고',
	'200'	=> '설치',
	'201'	=> '설치-신규',
	'202'	=> '설치-서비스',
	'203'	=> '설치-휴점 보관',
	'204'	=> '설치-휴점 점검',
	'205'	=> '설치-교체',
	'206'	=> '설치-리뉴얼',
	'300'	=> '철수',
	'301'	=> '철수-폐점',
	'302'	=> '철수-서비스',
	'303'	=> '철수-휴점 보관',
	'304'	=> '철수-휴점 점검',
	'305'	=> '철수-교체',
	'306'	=> '철수-리뉴얼',
	'400'	=> '교체',
	'500'	=> '수리',
	'600'	=> '폐기',
	'601'	=> '폐기-승인',
	'602'	=> '폐기-출고',
	'700'	=> '이동',
	'800'	=> '이관',
	'801'	=> '이관-입고',
	'802'	=> '이관-출고',
	'900'	=> '변경',
	'901'	=> '변경-점검',
);

// 업무 형태 (약어)
$config['gs2']['op_type_short'] = array(
	'100'	=> '입고',
	'200'	=> '설치',
	'201'	=> '신규',
	'202'	=> '서설',
	'203'	=> '휴설C',
	'204'	=> '휴설S',
	'205'	=> '교설',
	'206'	=> '리설',
	'300'	=> '철수',
	'301'	=> '폐점',
	'302'	=> '서철',
	'303'	=> '휴철C',
	'304'	=> '휴철S',
	'305'	=> '교철',
	'306'	=> '리철',
	'400'	=> '교체',
	'500'	=> '수리',
	'600'	=> '폐기',
	'601'	=> '폐기승인',
	'602'	=> '폐기출고',
	'700'	=> '이동',
	'800'	=> '이관',
	'801'	=> '이입',
	'802'	=> '이철',
	'900'	=> '변경',
	'901'	=> '점검',
);

// 업무 link base url
$config['gs2']['op_url'] = array(
	'100'	=> 'work/enter/view',
	'200'	=> 'work/install/view',
	'201'	=> 'work/install/view',
	'202'	=> 'work/install/view',
	'203'	=> 'work/install/view',
	'204'	=> 'work/install/view',
	'205'	=> 'work/install/view',
	'206'	=> 'work/install/view',
	'300'	=> 'work/close/view',
	'301'	=> 'work/close/view',
	'302'	=> 'work/close/view',
	'303'	=> 'work/close/view',
	'304'	=> 'work/close/view',
	'305'	=> 'work/close/view',
	'306'	=> 'work/close/view',
	'400'	=> 'work/replace/view',
	'500'	=> 'work/repair/view',
	'600'	=> 'work/destroy/view',
	'601'	=> 'work/destroy/view',
	'602'	=> 'work/destroy/view',
	'700'	=> 'work/move/view',
	'800'	=> 'work/transfer/view',
	'801'	=> 'work/transfer/view',
	'802'	=> 'work/transfer/view',
	'900'	=> 'work/change/view',
	'901'	=> 'work/change/view',
);

// 점포 가맹 타입 (DB 에서 불러와야 함)
$config['gs2']['store_join_type'] = array(
	'1' => '가맹1종A(순수)',
	'2' => '가맹1종C(전대)',
	'3' => '직영A (일반)',
	'4' => '직영B',
	'5' => 'C타입',
	'6' => 'G타입',
	'7' => 'K타입',
	'8' => 'S타입',
);

// 점포 상태
$config['gs2']['store_status'] = array(
	'0' => '폐점',
	'1' => '정상',
	'2' => '휴점-보관',
	'3'	=> '휴점-점검',
);

// 회원 타입
$config['gs2']['user_type'] = array(
	'0' => '전체',
	'1' => '시스네트',
	'2' => 'GS25',
	'3' => '납품처',
	'9'	=> '관리자',
);

// 시리얼장비 상태 텍스트
$config['gs2']['serial_part_status'] = array(
	'1' => '',
	'2' => '설치대기',
	'3' => '점검대기',
	'4' => '점검대기',
	'5' => '수리대기',
	'6' => '폐기대기',
	'7' => '이동대기',
	'9' => '점검중',
	'L'	=> '분실'
);

// 장비타입 텍스트
$config['gs2']['part_type'] = array(
	'0'	=> '--',	
	'1'	=> '시리얼',	
	'2'	=> '수량',	
	'3'	=> '소모품',	
);

// 설치,철수 업무 상태
$config['gs2']['op_type1'] = array(
	'0'	=> '-- 전체 --',	
	'1'	=> '요청',	
	'2'	=> '확정',	
	'3'	=> '점포완료',	
	'4'	=> '완료',	
	'5'	=> '승인',	
);

// 이동,폐기 상태
$config['gs2']['op_type2'] = array(
	'0'	=> '-- 전체 --',	
	'1'	=> '요청',	
	'2'	=> '입력',	
	'3'	=> '완료',	
);

// 입고 상태
$config['gs2']['op_type3'] = array(
	'0'	=> '-- 전체 --',	
	'1'	=> '요청',	
	'2'	=> '확정',	
	'3'	=> '입력',	
	'4'	=> '완료',	
);

/* End of file sisnet.php */
/* Location: ./application/config/sisnet.php */